app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["price", ""], ["created_at", "2020-12-23 07:52:44.838602"], ["updated_at", "2020-12-23 07:52:44.838602"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save